Revit 2024 API
ParameterDownloadOptions Methods
The ParameterDownloadOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCategories
 Get categories for binding.
GetGroupTypeId
 Get properties palette group identifier.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetCategories
 Set categories for binding.
SetGroupTypeId
 Set properties palette group identifier.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace